---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthDimensionTypeId
source: html/6cbea00b-f7f4-5dce-fa26-a447333bfea1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthDimensionTypeId Property

"Linear Dimension Style"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailTypeSegmentLengthDimensionTypeId { get; }
```